In [4]:
import pandas as pd
import numpy as np

In [35]:
data1 = {'Department': ['IT','IT','HR','HR','Trade','?','Trade','HR','IT'],
         'Education': ['Bachelor','Master','Master','Bachelor','PHD','PHD','Master','Master',''],
         'Sex': ['M','M','M','F','M','F','F','M','F'],
         'Title': ['analyst','analyst','analyst','analyst','associate','associate','associate','VP','VP'],
         'Year': [1.0,2.0,2.0,2.0,3.0,5.0,np.nan,8.0,9.0],
         'Name': ['Bob','Jake','John','Judy','Sam','Amy','Jennifer','Peter','Mary'],
         'Salary': [90,90,90,90,120,120,120,250,250]}
import pandas
Employee = pandas.DataFrame(data1)
type(Employee)

pandas.core.frame.DataFrame

In [36]:
Employee

  Department Education      Name  Salary Sex      Title  Year
0         IT  Bachelor       Bob      90   M    analyst   1.0
1         IT    Master      Jake      90   M    analyst   2.0
2         HR    Master      John      90   M    analyst   2.0
3         HR  Bachelor      Judy      90   F    analyst   2.0
4      Trade       PHD       Sam     120   M  associate   3.0
5          ?       PHD       Amy     120   F  associate   5.0
6      Trade    Master  Jennifer     120   F  associate   NaN
7         HR    Master     Peter     250   M         VP   8.0
8         IT                Mary     250   F         VP   9.0

In [37]:
Employee.loc[:,'Salary'] = Employee.loc[:,'Salary']*(1 + 0.05 * (Employee.loc[:,'Title'] =='VP') ) 
Employee

  Department Education      Name  Salary Sex      Title  Year
0         IT  Bachelor       Bob    90.0   M    analyst   1.0
1         IT    Master      Jake    90.0   M    analyst   2.0
2         HR    Master      John    90.0   M    analyst   2.0
3         HR  Bachelor      Judy    90.0   F    analyst   2.0
4      Trade       PHD       Sam   120.0   M  associate   3.0
5          ?       PHD       Amy   120.0   F  associate   5.0
6      Trade    Master  Jennifer   120.0   F  associate   NaN
7         HR    Master     Peter   262.5   M         VP   8.0
8         IT                Mary   262.5   F         VP   9.0

In [31]:
Employee

  Department Education      Name      Salary Sex      Title  Year
0         IT  Bachelor       Bob    0.000000   M    analyst   1.0
1         IT    Master      Jake    0.000000   M    analyst   2.0
2         HR    Master      John    0.000000   M    analyst   2.0
3         HR  Bachelor      Judy    0.000000   F    analyst   2.0
4      Trade       PHD       Sam    0.000000   M  associate   3.0
5          ?       PHD       Amy    0.000000   F  associate   5.0
6      Trade    Master  Jennifer    0.000000   F  associate   NaN
7         HR    Master     Peter  319.070391   M         VP   8.0
8         IT                Mary  319.070391   F         VP   9.0

In [42]:
temp = Employee.describe()
temp[["Salary","Year"]].apply(np.sum)

/home/efezino/anaconda3/lib/python3.5/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

Salary    901.585947
Year       25.023716
dtype: float64

In [40]:
temp

           Salary      Year
count    9.000000  8.000000
mean   138.333333  4.000000
std     71.752613  3.023716
min     90.000000  1.000000
25%     90.000000       NaN
50%    120.000000       NaN
75%    120.000000       NaN
max    262.500000  9.000000

In [43]:
Employee.isnull()

  Department Education   Name Salary    Sex  Title   Year
0      False     False  False  False  False  False  False
1      False     False  False  False  False  False  False
2      False     False  False  False  False  False  False
3      False     False  False  False  False  False  False
4      False     False  False  False  False  False  False
5      False     False  False  False  False  False  False
6      False     False  False  False  False  False   True
7      False     False  False  False  False  False  False
8      False     False  False  False  False  False  False

In [46]:
np.sum(Employee.isnull())

Department    0
Education     0
Name          0
Salary        0
Sex           0
Title         0
Year          1
dtype: int64

In [48]:
Employee.isnull().any(axis=1)

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
dtype: bool

In [49]:
Employee.isnull().all(axis=1)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [50]:
help(Employee.isnull)

Help on method isnull in module pandas.core.generic:

isnull() method of pandas.core.frame.DataFrame instance
    Return a boolean same-sized object indicating if the values are null.

    See Also
    --------
    notnull : boolean inverse of isnull

In [52]:
np.sum(Employee.notnull())

Department    9
Education     9
Name          9
Salary        9
Sex           9
Title         9
Year          8
dtype: int64

In [53]:
Employee.notnull().all(axis=0)

Department     True
Education      True
Name           True
Salary         True
Sex            True
Title          True
Year          False
dtype: bool

In [54]:
Employee.notnull().all(axis=1)

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
dtype: bool